{
  "keywords": {
    "привет": 1,
    "здравствуй": 1,
    "как": 2,
    "дела": 2,
    "пока": 3,
    "до": 3,
    "свидания": 3,
    "что": 4,
    "умеешь": 4,
    "ты": 5,
    "я": 5,
    "солнце": 4,
    "кто": 4,
    "сколько": 4,
    "земля": 4,
    "луна": 4,
    "вода": 4,
    "планет": 4,
    "самая": 4,
    "большая": 4,
    "плюс": 6,
    "минус": 6,
    "умножить": 6,
    "разделить": 6,
    "два": 6,
    "три": 6,
    "четыре": 6,
    "пять": 6
  },
  "knowledge": {
    "привет": "Привет! Рад тебя видеть!",
    "здравствуй": "Здравствуй! Как здорово, что ты тут!",
    "как дела": "У меня всё отлично, а у тебя?",
    "как дела у тебя": "Я в порядке, а ты как держишься?",
    "пока": "До встречи, пока!",
    "до свидания": "Пока-пока, не скучай!",
    "что умеешь": "Я умею болтать, считать любые числа на NumPy и отвечать на вопросы!",
    "что ты умеешь": "Я могу поболтать, посчитать всё что угодно и рассказать интересное!",
    "кто ты": "Я Tyi AI, твой весёлый помощник на NumPy!",
    "что такое солнце": "Солнце — это звезда в центре нашей солнечной системы, оно даёт нам свет и тепло!",
    "что такое земля": "Земля — это наша планета, третья от Солнца, на ней мы живём!",
    "что такое луна": "Луна — это спутник Земли, она светит ночью, отражая свет Солнца!",
    "что такое вода": "Вода — это жизнь! H2O, покрывает 71% Земли и нужна всем живым существам.",
    "сколько планет в солнечной системе": "В Солнечной системе 8 планет: Меркурий, Венера, Земля, Марс, Юпитер, Сатурн, Уран и Нептун!",
    "какая самая большая планета": "Самая большая планета — Юпитер, его диаметр около 140 000 км!",
    "что такое число": "Число — это абстрактное понятие для измерения количества, например, 1, 2, 3!",
    "сколько спутников у земли": "У Земли один естественный спутник — Луна!",
    "что такое звезда": "Звезда — это огромное горящее тело из газа, вроде Солнца, которое светит за счёт ядерного синтеза!",
    "какая самая близкая звезда": "Самая близкая звезда к Земле — это Солнце, примерно 150 миллионов км!",
    "": "Эй, я не совсем понял! Давай попробуем ещё раз?",
    "запутал": "Ой, ты меня запутал! Может, по порядку?",
    "не знаю": "Хм, интересный вопрос! Я пока не знаю ответа, но могу посчитать что-нибудь, если хочешь!"
  }
}
